stm32-rs/stm32f4xx-hal/src/dma.rs
                #[inline]
                fn set_transfer_error_interrupt_enable(&mut self, transfer_error_interrupt: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.teie().bit(transfer_error_interrupt));
                }

                #[inline]
                fn set_direct_mode_error_interrupt_enable(&mut self, direct_mode_error_interrupt: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.dmeie().bit(direct_mode_error_interrupt));
                }

                #[inline]
                fn set_fifo_error_interrupt_enable(&mut self, fifo_error_interrupt: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].fcr.modify(|_, w| w.feie().bit(fifo_error_interrupt));
                }

                #[inline]
                fn set_double_buffer(&mut self, double_buffer: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.dbm().bit(double_buffer));
                }

                #[inline]
                fn set_fifo_threshold(&mut self, fifo_threshold: config::FifoThreshold) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].fcr.modify(|_, w| w.fth().bits(fifo_threshold.bits()));
                }

                #[inline]
                fn set_fifo_enable(&mut self, fifo_enable: bool) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    //Register is actually direct mode disable rather than fifo enable
                    dma.st[Self::number()].fcr.modify(|_, w| w.dmdis().bit(fifo_enable));
                }

                #[inline]
                fn set_memory_burst(&mut self, memory_burst: config::BurstMode) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.mburst().bits(memory_burst.bits()));
                }

                #[inline]
                fn set_peripheral_burst(&mut self, peripheral_burst: config::BurstMode) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.pburst().bits(peripheral_burst.bits()));
                }

                #[inline]
                fn fifo_level() -> FifoLevel {
                    //NOTE(unsafe) Atomic read with no side effects
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].fcr.read().fs().bits().into()
                }

                #[inline]
                fn set_flow_controller(&mut self, flow_controller: config::FlowController) {
                    //NOTE(unsafe) We only access the registers that belongs to the StreamX
                    let dma = unsafe { &*I::ptr() };
                    dma.st[Self::number()].cr.modify(|_, w| w.pfctrl().bit(flow_controller.bits()));
                }

                fn current_buffer() -> CurrentBuffer {
                    //NOTE(unsafe) Atomic read with no side effects
                    let dma = unsafe { &*I::ptr() };
                    if dma.st[Self::number()].cr.read().ct().bit_is_set() {
                        CurrentBuffer::DoubleBuffer
                    } else {
                        CurrentBuffer::FirstBuffer
                    }
                }
            }
        )+
    };
}

dma_stream!(
    (Stream0, 0, lifcr, ctcif0, chtif0, cteif0, cdmeif0, cfeif0),
    (Stream1, 1, lifcr, ctcif1, chtif1, cteif1, cdmeif1, cfeif1),
    (Stream2, 2, lifcr, ctcif2, chtif2, cteif2, cdmeif2, cfeif2),
    (Stream3, 3, lifcr, ctcif3, chtif3, cteif3, cdmeif3, cfeif3),
    (Stream4, 4, hifcr, ctcif4, chtif4, cteif4, cdmeif4, cfeif4),
    (Stream5, 5, hifcr, ctcif5, chtif5, cteif5, cdmeif5, cfeif5),
    (Stream6, 6, hifcr, ctcif6, chtif6, cteif6, cdmeif6, cfeif6),
    (Stream7, 7, hifcr, ctcif7, chtif7, cteif7, cdmeif7, cfeif7),
);

/// A channel that can be configured on a DMA stream
pub trait Channel: Bits<u8> {}

/// Macro that defines a channel and it's conversion to u8
macro_rules! dma_channel {
    ($(($name:ident, $value:expr)),+ $(,)*) => {
        $(
            /// A Channel that can be configured on a DMA stream
            #[derive(Debug, Clone, Copy)]
            pub struct $name;
            impl Bits<u8> for $name {

                fn bits(self) -> u8 { $value }
            }
            impl Channel for $name {}
            impl $name {
                fn new() -> Self {
                    $name
                }
            }
        )+
    };
}

dma_channel!(
    (Channel0, 0),
    (Channel1, 1),
    (Channel2, 2),
    (Channel3, 3),
    (Channel4, 4),
    (Channel5, 5),
    (Channel6, 6),
    (Channel7, 7),
);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
dma_channel!((Channel8, 8), (Channel9, 9),);

/// Contains types related to DMA configuration
pub mod config {
    use super::Bits;

    /// Priority of the DMA stream. Defaults to Medium. Deadlocks are resolved by
    /// the lower numbered stream gets priority.
    #[derive(Debug, Clone, Copy)]
    pub enum Priority {
        /// Low priority
        Low,
        /// Medium priority
        Medium,
        /// High priority
        High,
        /// Very high priority
        VeryHigh,
    }

    impl Bits<u8> for Priority {
        fn bits(self) -> u8 {
            match self {
                Priority::Low => 0,
                Priority::Medium => 1,
                Priority::High => 2,
                Priority::VeryHigh => 3,
            }
        }
    }

    /// Size of the transfer. Same type for memory and peripheral size but the values
    /// needn't be the same. Check the datasheet for how byte packing/unpacking works.
    #[derive(Debug, Clone, Copy)]
    pub enum TransferSize {
        /// 8-bit
        Byte,
        /// 16-bit
        HalfWord,
        /// 32-bit
        Word,
    }

    impl Bits<u8> for TransferSize {
        fn bits(self) -> u8 {
            match self {
                TransferSize::Byte => 0,
                TransferSize::HalfWord => 1,
                TransferSize::Word => 2,
            }
        }
    }

